jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/NXP_LPC54608/FS_NOR_HW_SPIFI_LPC54608_NXP_LPCXpresso54608.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File    : FS_NOR_HW_SPIFI_LPC54608_NXP_LPCXpresso54608.c
Purpose : Low-level flash driver for NXP SPIFI interface.
Literature:
  [1] UM10912 LPC546xx User manual
    (\\FILESERVER\Techinfo\Company\NXP\MCU\LPC54xx\UM10912_LPC546xx_UserManual_Rev2.1.pdf)
  [2] UM11035 LPCXpresso546x8/540xx Board User Manual
    (\\fileserver\Techinfo\Company\NXP\MCU\LPC54xx\EvalBoard\LPCXpresso54608\UM11035_LPC546xx_Xpresso_UserManual.pdf)
  [3] Schematic
    (\\fileserver\Techinfo\Company\NXP\MCU\LPC54xx\EvalBoard\LPCXpresso54608\LPC54608_Dev_brd_schematic_Rev-B.pdf)
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"

/*********************************************************************
*
*      Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_HW_SPIFI_CLK_HZ
  #define FS_NOR_HW_SPIFI_CLK_HZ          (180000000uL / 3)   // Frequency of the clock supplied to SPIFI unit.
#endif

#ifndef   FS_NOR_HW_SPIFI_DATA_ADDR
  #define FS_NOR_HW_SPIFI_DATA_ADDR       0x10000000          // This is the start address of the memory region used by the file system
                                                              // to read the data from the serial NOR flash device. The hardware layer
                                                              // performs a dummy read from this address when switching to memory mode
                                                              // in order to clean the caches. It should be set to the value passed
                                                              // as second parameter to FS_NOR_Configure()/FS_NOR_BM_Configure() in FS_X_AddDevices().
#endif

#ifndef   FS_NOR_HW_RESET_DELAY_LOOPS
  #define FS_NOR_HW_RESET_DELAY_LOOPS     100000              // Number of software loops to wait for NOR device to reset
#endif

#ifndef   FS_NOR_HW_USE_OS
  #define FS_NOR_HW_USE_OS                0                   // Enables / disables the interrupt driver operation
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  #include "RTOS.h"
  #include "LPC54xxx.h"
  #include "FS_OS.h"
#endif

/*********************************************************************
*
*       Defines, fixed
*
**********************************************************************
*/

/*********************************************************************
*
*       SPIFI unit
*/
#define SPIFI_BASE_ADDR                           0x40080000
#define SPIFI_CTRL                                (*(volatile U32*)(SPIFI_BASE_ADDR + 0x00))    // SPIFI control register
#define SPIFI_CMD                                 (*(volatile U32*)(SPIFI_BASE_ADDR + 0x04))    // SPIFI command register
#define SPIFI_ADDR                                (*(volatile U32*)(SPIFI_BASE_ADDR + 0x08))    // SPIFI address register
#define SPIFI_IDATA                               (*(volatile U32*)(SPIFI_BASE_ADDR + 0x0C))    // SPIFI intermediate data register
#define SPIFI_CLIMIT                              (*(volatile U32*)(SPIFI_BASE_ADDR + 0x10))    // SPIFI cache limit register
#define SPIFI_DATA32                              (*(volatile U32*)(SPIFI_BASE_ADDR + 0x14))    // SPIFI data register (32-bit access, 4 bytes at once)
#define SPIFI_DATA16                              (*(volatile U16*)(SPIFI_BASE_ADDR + 0x14))    // SPIFI data register (16-bit access, 2 bytes at once)
#define SPIFI_DATA8                               (*(volatile U8*) (SPIFI_BASE_ADDR + 0x14))    // SPIFI data register (8-bit access, 1 byte at once)
#define SPIFI_MCMD                                (*(volatile U32*)(SPIFI_BASE_ADDR + 0x18))    // SPIFI memory command register
#define SPIFI_STAT                                (*(volatile U32*)(SPIFI_BASE_ADDR + 0x1C))    // SPIFI status register

/*********************************************************************
*
*       System configuration
*/
#define SYSCON_BASE_ADDR                          0x40000000uL
#define SYSCON_PRESETCTRL0                        (*(volatile U32*)(SYSCON_BASE_ADDR + 0x100))
#define SYSCON_PRESETCTRLSET0                     (*(volatile U32*)(SYSCON_BASE_ADDR + 0x120))
#define SYSCON_PRESETCTRLCLR0                     (*(volatile U32*)(SYSCON_BASE_ADDR + 0x140))
#define SYSCON_AHBCLKCTRL0                        (*(volatile U32*)(SYSCON_BASE_ADDR + 0x200))
#define SYSCON_AHBCLKCTRLSET0                     (*(volatile U32*)(SYSCON_BASE_ADDR + 0x220))
#define SYSCON_AHBCLKCTRLCLR0                     (*(volatile U32*)(SYSCON_BASE_ADDR + 0x240))
#define SYSCON_SPIFICLKSEL                        (*(volatile U32*)(SYSCON_BASE_ADDR + 0x2A0))
#define SYSCON_SPIFICLKDIV                        (*(volatile U32*)(SYSCON_BASE_ADDR + 0x390))

/*********************************************************************
*
*       System control unit
*/
#define IOCON_BASE_ADDR                           0x40001000uL
#define PIO0_23                                   (*(volatile U32*)(IOCON_BASE_ADDR + 0x05C))   // SPIFI_CS
#define PIO0_24                                   (*(volatile U32*)(IOCON_BASE_ADDR + 0x060))   // SPIFI_IO0
#define PIO0_25                                   (*(volatile U32*)(IOCON_BASE_ADDR + 0x064))   // SPIFI_IO1
#define PIO0_26                                   (*(volatile U32*)(IOCON_BASE_ADDR + 0x068))   // SPIFI_CLK
#define PIO0_27                                   (*(volatile U32*)(IOCON_BASE_ADDR + 0x06C))   // SPIFI_IO3
#define PIO0_28                                   (*(volatile U32*)(IOCON_BASE_ADDR + 0x070))   // SPIFI_IO2
#define PIO2_12                                   (*(volatile U32*)(IOCON_BASE_ADDR + 0x130))   // SPIFI_RST

/*********************************************************************
*
*       GPIO unit
*/
#define GPIO_BASE_ADDR                            0x4008C000uL
#define GPIO_DIR2                                 (*(volatile U32*)(GPIO_BASE_ADDR + 0x2008))   // Direction registers port 2
#define GPIO_SET2                                 (*(volatile U32*)(GPIO_BASE_ADDR + 0x2208))   // Set register for port 2
#define GPIO_CLR2                                 (*(volatile U32*)(GPIO_BASE_ADDR + 0x2288))   // Clear register for port 2

/*********************************************************************
*
*       SPIFI command register
*/
#define CMD_BITPOS_BIT                            0
#define CMD_BITPOS_MASK                           0x7uL
#define CMD_BITVAL_BIT                            3
#define CMD_BITVAL_MASK                           0x1uL
#define CMD_DATALEN_BIT                           0
#define CMD_DATALEN_MASK                          0x3FFFuL
#define CMD_POLL_BIT                              14
#define CMD_DOUT_BIT                              15
#define CMD_INTLEN_BIT                            16
#define CMD_INTLEN_MASK                           0x7uL
#define CMD_FIELDFORM_BIT                         19
#define CMD_FIELDFORM_ALL_SERIAL                  0x0uL
#define CMD_FIELDFORM_QUAD_DUAL_DATA              0x1uL
#define CMD_FIELDFORM_SERIAL_OPCODE               0x2uL
#define CMD_FIELDFORM_ALL_QUAD_DUAL               0x3uL
#define CMD_FRAMEFORM_BIT                         21
#define CMD_FRAMEFORM_OPCODE                      0x1uL
#define CMD_FRAMEFORM_OPCODE_1BYTE                0x2uL
#define CMD_FRAMEFORM_OPCODE_2BYTES               0x3uL
#define CMD_FRAMEFORM_OPCODE_3BYTES               0x4uL
#define CMD_FRAMEFORM_OPCODE_4BYTES               0x5uL
#define CMD_OPCODE_BIT                            24
#define CMD_OPCODE_MASK                           0xFFuL

/*********************************************************************
*
*       SPIFI control register
*/
#define CTRL_TIMEOUT_BIT                          0
#define CTRL_CSHIGH_BIT                           16
#define CTRL_D_PRFTCH_DIS_BIT                     21
#define CTRL_MODE3_BIT                            23
#define CTRL_INTEN_BIT                            22
#define CTRL_PRFTCH_DIS_BIT                       27
#define CTRL_DUAL_BIT                             28
#define CTRL_FBCLK_BIT                            30

/*********************************************************************
*
*       SPIFI status register
*/
#define STAT_MCINIT_BIT                           0
#define STAT_CMD_BIT                              1
#define STAT_RESET_BIT                            4
#define STAT_INTRQ_BIT                            5

/*********************************************************************
*
*       Port I/O settings
*/
#define PIO_FUNC_BIT                              0
#define PIO_MODE_BIT                              4
#define PIO_MODE_PULLUP                           2u
#define PIO_INVERT_BIT                            7
#define PIO_DIGIMODE_BIT                          8
#define PIO_FILTEROFF_BIT                         9
#define PIO_SLEW_BIT                              10
#define PIO_OD_BIT                                11

/*********************************************************************
*
*       Misc. defines
*/
#define SPIFI_PRIO                                15
#define AHBCLKCTRL0_SPIFI_BIT                     10
#define AHBCLKCTRL0_IOCON_BIT                     13
#define PRESETCTRL_SPIFI_RST_BIT                  10
#define SPIFICLKSEL_SEL_BIT                       0
#define SPIFICLKSEL_SEL_MAIN_CLK                  0
#define SPIFICLKSEL_SEL_PLL_CLK                   1
#define SDIOCLKDIV_DIV_BIT                        0
#define NOR_RESET_BIT                             12
#define WAIT_TIMEOUT                              1000      // milliseconds
#define CYCLES_PER_MS                             20000     // Blocks the execution for about 1ms on a CPU running at 180 Mhz.
#define WAIT_TIMEOUT_CYCLES                       (WAIT_TIMEOUT * CYCLES_PER_MS)

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _GetFieldForm
*
*  Function description
*    Determines the value to be stored in the FIELDFORM field
*    of the SPIFI_CMD and SPIFI_MCMD registers. It also returns
*    the value of the SPIFI_CTRL.DUAL field.
*/
static U32 _GetFieldForm(U16 BusWidth, int * pIsDual) {
  U32 FieldForm;
  int IsDual;

  IsDual = 0;
  if (BusWidth == 0x112u) {
    FieldForm = CMD_FIELDFORM_QUAD_DUAL_DATA;   // Data field is dual other fields are serial.
    IsDual    = 1;
  } else if (BusWidth == 0x114u) {
    FieldForm = CMD_FIELDFORM_QUAD_DUAL_DATA;   // Data field is quad other fields are serial.
  } else if (BusWidth == 0x122u) {
    FieldForm = CMD_FIELDFORM_SERIAL_OPCODE;    // Opcode field is serial. Other fields are dual.
    IsDual    = 1;
  } else if (BusWidth == 0x144u) {
    FieldForm = CMD_FIELDFORM_SERIAL_OPCODE;    // Opcode field is serial. Other fields are quad.
  } else if (BusWidth == 0x444u) {
    FieldForm = CMD_FIELDFORM_ALL_QUAD_DUAL;    // Opcode field is serial. Other fields are quad.
  } else {
    FieldForm = CMD_FIELDFORM_ALL_SERIAL;       // All fields of the command are serial.
  }
  if (pIsDual) {
    *pIsDual = IsDual;
  }
  return FieldForm;
}

/*********************************************************************
*
*       _GetFrameForm
*
*  Function description
*    Determines the value to be stored in the FAMEFORM field
*    of the SPIFI_CMD and SPIFI_MCMD registers.
*/
static U32 _GetFrameForm(unsigned NumBytesAddr) {
  U32 FrameForm;

