jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/NXP_LPC54608/FS_NOR_HW_SPIFI_LPC54608_NXP_LPCXpresso54608.c
  if (NumBytesAddr == 1) {
    FrameForm = CMD_FRAMEFORM_OPCODE_1BYTE;     // Opcode + 1 address byte.
  } else if (NumBytesAddr == 2) {
    FrameForm = CMD_FRAMEFORM_OPCODE_2BYTES;    // Opcode + 2 address bytes.
  } else if (NumBytesAddr == 3) {
    FrameForm = CMD_FRAMEFORM_OPCODE_3BYTES;    // Opcode + 3 address bytes.
  } else if (NumBytesAddr == 4) {
    FrameForm = CMD_FRAMEFORM_OPCODE_4BYTES;    // Opcode + 4 address bytes.
  } else {
    FrameForm = CMD_FRAMEFORM_OPCODE;           // Opcode, no address bytes.
  }
  return FrameForm;
}

/*********************************************************************
*
*       _Reset
*/
static void _Reset(void) {
  SPIFI_STAT = (1uL << STAT_RESET_BIT);               // Reset the SPIFI controller. The controller is put into SPI mode.
  while (1) {
    if ((SPIFI_STAT & ((1uL << STAT_CMD_BIT)   |
                       (1uL << STAT_RESET_BIT) |
                       (1uL << STAT_MCINIT_BIT))) == 0) {
      break;                                          // Wait until the SPIFI controller is ready again.
    }
  }
}

/*********************************************************************
*
*      Public code
*
**********************************************************************
*/

#if FS_NOR_HW_USE_OS

/*********************************************************************
*
*       SPIFI0_IRQHandler
*/
void SPIFI0_IRQHandler(void);
void SPIFI0_IRQHandler(void) {
  OS_EnterInterrupt();                          // Tell embOS that we enter the ISR.
  SPIFI_STAT |= 1uL << STAT_INTRQ_BIT;          // Prevent other interrupts from occurring.
  FS_X_OS_Signal();
  OS_LeaveInterrupt();                          // Tell embOS that we leage the ISR.
}

#endif

/*********************************************************************
*
*      Public code (via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    HW layer function. It is called before any other function of the physical layer.
*    It should configure the HW so that the other functions can access the NOR flash.
*
*  Return value
*    Frequency of the SPI clock in Hz.
*/
static int _HW_Init(U8 Unit) {
  unsigned NumLoops;
  unsigned TimeOut;

  FS_USE_PARA(Unit);    // This device has only one HW unit.
  //
  // Enable the clock for the IO controller if required.
  //
  if ((SYSCON_AHBCLKCTRL0 & (1uL << AHBCLKCTRL0_IOCON_BIT)) == 0) {
    SYSCON_AHBCLKCTRLSET0 = 1uL << AHBCLKCTRL0_IOCON_BIT;
    TimeOut = WAIT_TIMEOUT_CYCLES;
    while (1) {
      if ((SYSCON_AHBCLKCTRL0 & (1uL << AHBCLKCTRL0_IOCON_BIT)) != 0) {
        break;
      }
      if (--TimeOut == 0) {
        break;
      }
    }
  }
  //
  // Disable the SPIFI clock if required.
  //
  if ((SYSCON_AHBCLKCTRL0 & (1uL << AHBCLKCTRL0_SPIFI_BIT)) != 0) {
    SYSCON_AHBCLKCTRLCLR0 = 1uL << AHBCLKCTRL0_SPIFI_BIT;
    TimeOut = WAIT_TIMEOUT_CYCLES;
    while (1) {
      if ((SYSCON_AHBCLKCTRL0 & (1uL << AHBCLKCTRL0_SPIFI_BIT)) == 0) {
        break;
      }
      if (--TimeOut == 0) {
        break;
      }
    }
  }
  //
  // Reset SPIFI.
  //
  SYSCON_PRESETCTRLSET0 = 1uL << PRESETCTRL_SPIFI_RST_BIT;
  SYSCON_PRESETCTRLCLR0 = 1uL << PRESETCTRL_SPIFI_RST_BIT;
  //
  // Select the clock for SPIFI and configure the divisor.
  //
  SYSCON_SPIFICLKSEL = SPIFICLKSEL_SEL_MAIN_CLK << SPIFICLKSEL_SEL_BIT;
  SYSCON_SPIFICLKDIV = 2uL << SDIOCLKDIV_DIV_BIT;       // Do not forget to update FS_NOR_HW_SPIFI_CLK_HZ.
  //
  // Enable the SPIFI clock.
  //
  SYSCON_AHBCLKCTRLSET0 = 1uL << AHBCLKCTRL0_SPIFI_BIT;
  TimeOut = WAIT_TIMEOUT_CYCLES;
  while (1) {
    if ((SYSCON_AHBCLKCTRL0 & (1uL << AHBCLKCTRL0_SPIFI_BIT)) != 0) {
      break;
    }
    if (--TimeOut == 0) {
      break;
    }
  }
  PIO0_23 = 0  // SPIFI_CS
          | (1uL << PIO_SLEW_BIT)
          | (1uL << PIO_FILTEROFF_BIT)
          | (1uL << PIO_DIGIMODE_BIT)
          | (6uL << PIO_FUNC_BIT)
          ;
  PIO0_26 = 0  // SPIFI_CLK
          | (1uL << PIO_SLEW_BIT)
          | (1uL << PIO_FILTEROFF_BIT)
          | (1uL << PIO_DIGIMODE_BIT)
          | (6uL << PIO_FUNC_BIT)
          ;
  PIO0_24 = 0  // SPIFI_IO0
          | (1uL << PIO_SLEW_BIT)
          | (1uL << PIO_FILTEROFF_BIT)
          | (1uL << PIO_DIGIMODE_BIT)
          | (6uL << PIO_FUNC_BIT)
          ;
  PIO0_25 = 0  // SPIFI_IO1
          | (1uL << PIO_SLEW_BIT)
          | (1uL << PIO_FILTEROFF_BIT)
          | (1uL << PIO_DIGIMODE_BIT)
          | (6uL << PIO_FUNC_BIT)
          ;
  PIO0_28 = 0  // SPIFI_IO2
          | (1uL << PIO_SLEW_BIT)
          | (1uL << PIO_FILTEROFF_BIT)
          | (1uL << PIO_DIGIMODE_BIT)
          | (6uL << PIO_FUNC_BIT)
          ;
  PIO0_27 = 0  // SPIFI_IO3
          | (1uL << PIO_SLEW_BIT)
          | (1uL << PIO_FILTEROFF_BIT)
          | (1uL << PIO_DIGIMODE_BIT)
          | (6uL << PIO_FUNC_BIT)
          ;

  //
  // Reset pin. Present only on 16-pin devices.
  //
  PIO2_12 = 0
          | (1uL << PIO_SLEW_BIT)
          | (1uL << PIO_FILTEROFF_BIT)
          | (1uL << PIO_DIGIMODE_BIT)
          ;
  GPIO_DIR2 |= 1uL << NOR_RESET_BIT;
  //
  // Reset the NOR device.
  //
  GPIO_CLR2 = 1uL << NOR_RESET_BIT;                 // Assert reset signal (active low).
  NumLoops = FS_NOR_HW_RESET_DELAY_LOOPS;
  do {
    ;
  } while (--NumLoops);
  GPIO_SET2 = 1uL << NOR_RESET_BIT;                 // De-assert reset signal (active low).
#if FS_NOR_HW_USE_OS
  //
  // Disable the interrupt and configure the priority.
  //
  NVIC_DisableIRQ(SPIFI0_IRQn);
  NVIC_SetPriority(SPIFI0_IRQn, SPIFI_PRIO);
#endif
  //
  // Configure the SPIFI unit.
  //
  SPIFI_CTRL = 0
             | (0xFFFFuL << CTRL_TIMEOUT_BIT)       // Use the maximum timeout.
             | (0xFuL    << CTRL_CSHIGH_BIT)        // Set minimum CS high time to maximum value.
             | (0x1uL    << CTRL_D_PRFTCH_DIS_BIT)  // Disable memory prefetches.
             | (0x1uL    << CTRL_MODE3_BIT)         // CLK idle mode is high.
             | (0x1uL    << CTRL_PRFTCH_DIS_BIT)    // Disables prefetching of cache lines.
             | (0x1uL    << CTRL_FBCLK_BIT)         // Read data is sampled using a feedback clock from the SCK pin.
             ;
#if FS_NOR_HW_USE_OS
  //
  // Clear interrupt flag.
  //
  SPIFI_STAT = 1uL << STAT_INTRQ_BIT;
  NVIC_EnableIRQ(SPIFI0_IRQn);
#endif
  return FS_NOR_HW_SPIFI_CLK_HZ;
}

/*********************************************************************
*
*       _HW_SetCmdMode
*
*  Function description
*    HW layer function. It enables the direct access to NOR flash via SPI.
*    This function disables the memory-mapped mode.
*/
static void _HW_SetCmdMode(U8 Unit) {
  FS_USE_PARA(Unit);            // This device has only one HW unit.
  _Reset();
}

/*********************************************************************
*
*       _HW_SetMemMode
*
*  Function description
*    HW layer function. It enables the memory-mapped mode. In this mode
*    the data can be accessed by doing read operations from memory.
*    The HW is responsible to transfer the data via SPI.
*    This function disables the direct access to NOR flash via SPI.
*/
static void _HW_SetMemMode(U8 Unit, U8 ReadCmd, unsigned NumBytesAddr, unsigned NumBytesDummy, U16 BusWidth) {
  U32 FieldForm;
  U32 FrameForm;
  U32 OpCode;
  U32 IntLen;
  int IsDual;
  U32 MCmdReg;
  U32 v;

